Catalogs/абс_ХозяйственныеОперацииПУБ77/абс_ХозяйственныеОперацииПУБ77.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>абс_ХозяйственныеОперацииПУБ77</name>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипМетаданных</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.абс_ТипыОбъектовОбменаПУБ77</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяНастройка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Catalogs/абс_ХозяйственныеОперацииПУБ77/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	// 1. Проверим уникальность наименования
	//Запрос = Новый Запрос(
	//"ВЫБРАТЬ
	//|	абс_ХозяйственныеОперацииПУБ77.Наименование
	//|ИЗ
	//|	Справочник.абс_ХозяйственныеОперацииПУБ77 КАК абс_ХозяйственныеОперацииПУБ77
	//|ГДЕ
	//|	абс_ХозяйственныеОперацииПУБ77.Наименование = &Наименование
	//|	И НЕ абс_ХозяйственныеОперацииПУБ77.Ссылка = &Ссылка");
	//
	//Запрос.УстановитьПараметр("Наименование"	, Наименование);
	//Запрос.УстановитьПараметр("Ссылка"			, Ссылка);
	//
	//Если НЕ Запрос.Выполнить().Пустой() Тогда
	//	
	//	ОбщегоНазначения.СообщитьОбОшибке("Наименование хозяйственной операции неуникально!", Отказ);
	//	
	//КонецЕсли;
	
	// 2. Проверим наличие основной настройки
	//Запрос = Новый Запрос(
	//"ВЫБРАТЬ
	//|	абс_ХозяйственныеОперацииПУБ77.Ссылка
	//|ИЗ
	//|	Справочник.абс_ХозяйственныеОперацииПУБ77 КАК абс_ХозяйственныеОперацииПУБ77
	//|ГДЕ
	//|	абс_ХозяйственныеОперацииПУБ77.ТипМетаданных = &ТипМетаданных
	//|	И абс_ХозяйственныеОперацииПУБ77.ОсновнаяНастройка = &ОсновнаяНастройка
	//|	И НЕ абс_ХозяйственныеОперацииПУБ77.Ссылка = &Ссылка");
	//
	//Запрос.УстановитьПараметр("ТипМетаданных"		, ТипМетаданных);
	//Запрос.УстановитьПараметр("ОсновнаяНастройка"	, Истина);
	//Запрос.УстановитьПараметр("Ссылка"				, Ссылка);
	//
	//Если Запрос.Выполнить().Пустой() И НЕ ОсновнаяНастройка Тогда
	//	
	//	ОбщегоНазначения.СообщитьОбОшибке("В справочнике должна быть введена одна основная настройка", Отказ);
	//	
	//КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Если текущая настройка основная, снимем признак со всех остальных настроек
	Если ОсновнаяНастройка Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	абс_ХозяйственныеОперацииПУБ77.Ссылка
		|ИЗ
		|	Справочник.абс_ХозяйственныеОперацииПУБ77 КАК абс_ХозяйственныеОперацииПУБ77
		|ГДЕ
		|	абс_ХозяйственныеОперацииПУБ77.ТипМетаданных = &ТипМетаданных
		|	И абс_ХозяйственныеОперацииПУБ77.ОсновнаяНастройка = &ОсновнаяНастройка
		|	И НЕ абс_ХозяйственныеОперацииПУБ77.Ссылка = &Ссылка");
		
		Запрос.УстановитьПараметр("ТипМетаданных"		, ТипМетаданных);
		Запрос.УстановитьПараметр("ОсновнаяНастройка"	, Истина);
		Запрос.УстановитьПараметр("Ссылка"				, Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Объект = Выборка.Ссылка.ПолучитьОбъект();
			
			Объект.ОсновнаяНастройка = Ложь;
			
			Объект.ОбменДанными.Загрузка = Истина;
			
			Объект.Записать();
			
		КонецЦикла;
				
	КонецЕсли;	
	
КонецПроцедуры
